guilemes1/seqProg_PIC16F887/seqProg_16F887_V1.X/main.c
/*
 * File:   main.c
 * Author: josewrpereira
 *
 * Created on 15 de Agosto de 2020, 16:03:21
 *
 * -------------------------------------------------
 *          MAPA DE ENTRADAS E SAIDAS
 * -------------------------------------------------
 *  Pinos   |nº     | Conexao
 * ---------|-------|-------------------------------
 *  RA0     |2      | OUT : Output
 *  RA1     |3      | IN : Input 
 *  RA3     |5      | SHLD : Shift / Load
 *  RA2     |4      | CLK : Clock
 
 *  RC3     |18     | MCP4725_SCL
 *  RC4     |23     | MCP4725_SDA
 *  RC6     |25     | ESP01_TX
 *  RC7     |26     | ESP01_RX

 *  RB0     |33     | LCD_D4
 *  RB1     |34     | LCD_D5
 *  RB2     |35     | LCD_D6
 *  RB3     |36     | LCD_D7
 *  RB4     |37     | LCD_RS
 *  RB5     |38     | LCD_EN
 
 *  RD0     |19     | TECLADO_L0
 *  RD1     |20     | TECLADO_L1
 *  RD2     |21     | TECLADO_L2
 *  RD3     |22     | TECLADO_L3
 *  RD4     |27     | TECLADO_C0
 *  RD5     |28     | TECLADO_C1
 *  RD6     |29     | TECLADO_C2
 *  RD7     |30     | TECLADO_C3
 * -------------------------------------------------
 * -------------------------------------------------
 */
#include <xc.h>
#include "config.h"
#include "delay.h"
#include "dispLCD4vias.h"
#include "teclado.h"
#include "fifo.h"
#include "serialIO.h"
#include "atuadores.h"
#include "timer1.h"
#include "estados.h"
#include "ihm.h"
#include "eeprom.h"

void __interrupt() irq(void)
{
    INTCONbits.GIE = 0;
    if(PIR1bits.TMR1IF && PIE1bits.TMR1IE)
    {
        PIR1bits.TMR1IF = 0;
        //INT_T1;
        intt1_1ms();
    }
    INTCONbits.GIE = 1;    
}


void main(void)
{    
    dispLCD_init();
    teclado_init();
    timer1_init();
    
//    char *texto;
    char tecla = 0;
    char estado = INICIO;
    char atuador;
    char vetor_aux[16];              //Vetor criado para buscar as sequencias salvas na memoria
    char init_cond = 0;              //Variavel que salvara as condições iniciais dos atuadores
    char *pt;                        //Ponteiro auxiliar utilizado para varrer o "vetor_aux"
//    char lin2[17] = "                ";
    char contPassos = 0;
    char vetorIn[1] = { 0 };
    char vetorOut[1] = { 0 };
    initSerialIO( vetorIn, vetorOut, 1 );
    char meAtuadores = -1;
    char auxPasso = 0; 
    char aux = 2;
    unsigned int num = 0;    
    unsigned int ciclos = 0;
    char botao = 0;
#define STOP    0
#define PLAY    1
#define PAUSE   2
#define STEP    3
//    char boolPause = 0;
//  #define boolPlay !boolPause
//    char boolStop = 0;
//    char pauseLeft = 0;
//    char pauseRight = 0;
//    char meAtAux = 0;
//    char next = 0;

    while(1)
    {        
         switch(estado)
        {        
             case INICIO:                                           //TELA DE INICIO(CARREGA BARRAS)
                            for(char i = 0; i <= 3; i++)
                            {
                                for(char j = 0; j <= 19; j++)
                                {
                                    IHM.printpos(i, j, "\377");
                                    delay(10);
                                }
                            }

                            for(char i = 0; i <= 3; i++)
                            {
                                for(char j = 0; j <= 19; j++)
                                {
                                    IHM.printpos(i, j, " ");
                                    delay(10);
                                }
                            }
                            estado = TELA_EMPRESA;
                            break;
                    
            case TELA_EMPRESA:
                            IHM.printpos(1, 0, "      SEGGTTI       ");         
                            
                            char lema[20] = "Mundo ao seu comando";         
                            char i = 0;
                            char *ptr;
                            
                            for(ptr = lema; *ptr != 0; ptr++)            //Inserido para exibicao de lema na TELA_EMPRESA
                            {
                                dispLCD_lincol( 2, i );
                                dispLCD_dataReg( *ptr );
                                i++;
                                delay(50);
                            }
                                               
                            setT1(1500);                            
                            estado = TELA_EMPRESA_DELAY;            
                            break;
                    
             case TELA_EMPRESA_DELAY:
                            if(!statusT1())                         
                                estado = TELA_MENU;                    
                            break;
                            
//             case INICIO_ATUADORES:
//                            init_atuadores();
//                            IHM.clr();
//                            IHM.print("\n"
//                                      "    INICIALIZANDO\n"                                                      
//                                      "       SAIDAS...");
//                            setT1(1000);
//                            estado = INICIO_ATUADORES_DELAY;
//                            break; 
                            
//             case INICIO_ATUADORES_DELAY:
//                            if(!statusT1())                         
//                                estado = TELA_MENU;
//                            break;               
                            
             case TELA_MENU:  
                            init_atuadores();                      //INICIA OS ATUADORES RECUADOS
                            IHM.print("1: INSERIR SEQUENCIA\n"
                                      "2: BUSCAR SEQUENCIA\n"
                                      "3: REPETIR ULT. SEQU\n"
                                      "4: CONFIGURACOES    ");   
                            setT1(1000);                            
                            estado = TELA_MENU_DELAY;
                            break;
                            
            case TELA_MENU_DELAY:
                            if(!statusT1())                         
                                estado = TELA_MENU_TECLA;                    
                            break;
                            
            case TELA_MENU_TECLA:   
                            tecla = teclado_borda();
                            switch(tecla)
                            {
                                case '1':   estado = TELA_AJUSTE_INICIAL;       break;
                                case '2':   estado = TELA_BUSCAR_SEQUENCIA;     break;
                                case '3':   break;
//                              case '4':   estado = TELA_CONFIGURACOES;         break;                                                        
                            }
                            break;
                            
//             case TELA_CONFIGURACOES:
//                            dispLCD_clr();
//                            dispLCD(0,0,"1: VERIFICAR MEMORIA");  
//                            dispLCD(1,0,"2: LIMPAR MEMORIA   ");
//             
//                            setT1(1000);                                   //INICIA A CONTAGEM DO TEMPO DE 1seg
//                            estado = TELA_CONFIG_DELAY;
//                            break;
//                            
//             case TELA_CONFIG_DELAY:
//                            if(!statusT1())                         //QUANDO TERMINAR A CONTAGEM PASSA PARA O PROXIMO ESTADO
//                                estado = TELA_CONFIG_TECLA;                    
//                            break;               
//                            
//             case TELA_CONFIG_TECLA:                           
//                            tecla = teclado_borda();
//                            switch(tecla)
//                            {
//                                case '1':   estado = TELA_VERIFICAR_MEMORIA;       break;
//                                case '2':   estado = TELA_LIMPAR_MEMORIA;          break; 
//                                case TECLA_DELETE:  estado = TELA_MENU;            break;  //Inserido para retornar a pagina anterior
//                            }
//                            break; 
//                            
//             case TELA_LIMPAR_MEMORIA: 
//                            dispLCD(0, 0, " CERTEZA QUE DESEJA ");
//                            dispLCD(1, 0, "   DELETAR TODA A   ");
//                            dispLCD(2, 0, "      MEMORIA ?     ");
//                            dispLCD(3, 0, "# - SIM      * - NAO");
//                            
//                            tecla = teclado_borda();
//                            switch(tecla)
//                            {
//                                case '#':   estado = TELA_LIMPANDO_MEMORIA;               break;
//                                
//                                case '*':   dispLCD_clr(); estado = TELA_CONFIGURACOES;   break;                        
//                            }
//                            break;
//                            
//             case TELA_LIMPANDO_MEMORIA:                               
//                            receita.formatar();                          //Formata a memoria - Trava sempre que executado no simulador
//                            dispLCD_clr();
//                            for(char i = 0; i <= 3; i++)
//                            {
//                                for(char j = 0; j <= 19; j++)
//                                {
//                                    dispLCD(i, j, "\377");
//                                    delay(10);
//                                }
//                            }
//
//                            for(char i = 0; i <= 3; i++)
//                            {
//                                for(char j = 0; j <= 19; j++)
//                                {
//                                    dispLCD(i, j, " ");
//                                    delay(10);
//                                }
//                            }
//                            dispLCD(1, 0, "       DELETED      ");         //EXIBE A MENSAGEM NA 1Âª LINHA DO DISPLAY
//                            dispLCD(2, 0, "        MEMORY      ");
//                            
//                            setT1(1000);                                   //INICIA A CONTAGEM DO TEMPO DE 1seg
//                            estado = TELA_LIMPANDO_MEMORIA_DELAY;       
//                            break; 
//                            
//             case TELA_LIMPANDO_MEMORIA_DELAY:
//                            if(!statusT1())                         //QUANDO TERMINAR A CONTAGEM PASSA PARA O PROXIMO ESTADO
//                                estado = TELA_CONFIGURACOES;                    
//                            break;   
                            
             case TELA_BUSCAR_SEQUENCIA:
                            IHM.clr();
                            IHM.print(" ESCOLHA A MEMORIA \n"  
                                      "QUE DESEJA EXECUTAR\n"
                                      " 0   1   2   3   4 \n"          //NESSA ETAPA SERIA DESEJAVEL QUE APARECESSE APENAS OS ESPAÃ‡OS DISPONIVEIS
                                      " 5   6   7   8   9 \n");
                            estado = TELA_CARREGA_SEQUENCIA;
                            
             case TELA_CARREGA_SEQUENCIA:
                            tecla = teclado_borda();
                            switch(tecla)
                            {
                                case '0': 
                                case '1': 
                                case '2': 
                                case '3':
                                case '4': 
                                case '5': 
                                case '6': 
                                case '7':
                                case '8': 
                                case '9':
                                           buscar_dado(10, tecla % 0x30, &init_cond);       //Busca o endereço de memoria onde foi salvo a condicao inicial dos atuadores e guarda na variavel "init_cond"                                         
                                           manipula_atuadores_init(init_cond);              //Realiza a manipulação dos atuadores conforme as condicoes iniciais da sequencia expressa pela variavel "init_cond"
                                           
                                           EEPROM.buscar(tecla % 0x30, vetor_aux);         //Busca a receita pressionada pelo usuario e insere em "vetor_aux"                                     
                                           pt = vetor_aux;
                                           
                                           if(*pt == 0xFF)                                  //Verifica se o primeiro byte do endereço de memoria esta no padrao defalt (0xFF) 
                                           {
                                               EEPROM.deletar(tecla % 0x30);
                                               vetor_aux[0] = 0;
                                           }
                                           
                                          
                                           for(char *ptr = vetor_aux; *ptr != 0; ptr++)     //Varre o vetor_aux e insere os passos na fila (vetor fila)
                                           {                                                  
                                                if(*ptr & 0x80)
                                                {
                                                    fifo_add_tempo(*ptr);
                                                }
                                                else 
                                                {
                                                    switch( *ptr )
                                                    {
                                                        case 'A':
                                                        case 'B':
                                                        case 'C':
                                                        case 'D':
                                                        case 'a':
                                                        case 'b':
                                                        case 'c':
                                                        case 'd':                           
                                                                *ptr &= ~0x20;   //Converte os caracteres para maiusculo
                                                                break;
                                                    }            
                                                    alt_atuador(*ptr);                                                  
                                                    fifo_add( ler_atuador(*ptr) ? *ptr : *ptr|0x20 );
                                                }
                                                fifo_print();
                                           }                                      
                                           
                                           dispLCD_clr();
                                           estado = TELA_PRINTFILA;
                                           break;
                                           
                                case TECLA_DELETE:  estado = TELA_MENU;   break;  //Inserido para retornar a pagina anterior         
                            }
                            break;
                    
             case TELA_AJUSTE_INICIAL:
                            IHM.clr();                          
                            IHM.printpos(0, 0, "   AJUSTE O INICIO  ");      
                            IHM.printpos(1, 0, "     DO SISTEMA     ");      
                            estado = TELA_DISPLAY_ATUADORES;                
                            break;
                         
