guilemes1/seqProg_PIC16F887/seqProg_16F887_V1.X/main.c
            case TELA_DISPLAY_ATUADORES:                        
                            IHM.printpos(3,0,"   A   B   C   D    ");                               
                            dispLCD_lincol(3, 4); dispLCD_dataReg(ler_atuador('A') ? '+' : '-');    //Inserido para pegar o status atual dos atuadores após retornar da tela posterior (TELA_CONTAR_PASSOS)
                            dispLCD_lincol(3, 8);dispLCD_dataReg(ler_atuador('B') ? '+' : '-');
                            dispLCD_lincol(3, 12);dispLCD_dataReg(ler_atuador('C') ? '+' : '-');
                            dispLCD_lincol(3, 16);dispLCD_dataReg(ler_atuador('D') ? '+' : '-');
                            estado = TELA_EDICAO_ATUADORES;
                            break;
                            
            case TELA_EDICAO_ATUADORES:
                            tecla = teclado_borda();
                            switch(tecla)
                            {
                                case 'A':   alt_atuador(tecla); dispLCD_lincol(3, 4); dispLCD_dataReg(ler_atuador('A') ? '+' : '-');     break;
                                case 'B':   alt_atuador(tecla); dispLCD_lincol(3, 8); dispLCD_dataReg(ler_atuador('B') ? '+' : '-');     break;
                                case 'C':   alt_atuador(tecla); dispLCD_lincol(3,12); dispLCD_dataReg(ler_atuador('C') ? '+' : '-');     break;
                                case 'D':   alt_atuador(tecla); dispLCD_lincol(3,16); dispLCD_dataReg(ler_atuador('D') ? '+' : '-');     break;
                                case TECLA_ENTER:   estado = TELA_INSERIR_PASSOS;                            break;                        
                                case TECLA_DELETE:  estado = TELA_MENU;                                      break;   //Inserido para retonar a tela anterior
                            }
                            break;

                    // TELA DE EDIÃ‡AO

            case TELA_INSERIR_PASSOS:
                            init_cond = salva_atuadores_init();	         //Guarda as condicoes iniciais dos atuares na variavel "init_cond"
                            IHM.clr();                             
                            IHM.printpos(0, 0, "  INSIRA OS PASSOS  ");     
                            estado = TELA_CONTAR_PASSOS;
                            break;

             case TELA_EDITAR_PASSOS:
                            tecla = teclado_borda();               
                            switch( tecla )
                            {
                                case 'A': 
                                case 'B': 
                                case 'C': 
                                case 'D': 
                                            if( fifo_disponivel() )                 //Se houver espaco disponivel na fila (ind_fila < tam_vetor) ELE EXECUTA:
                                            {   
                                                alt_atuador(tecla);                                     
                                                fifo_add( ler_atuador(tecla) ? tecla : tecla|0x20 );    
                                                estado = TELA_PRINTFILA;
                                            }
                                            break;
                                case TECLA_RIGHT:                                   //TECLA '6'
                                            fifo_indicePrint_inc();
                                            estado = TELA_PRINTFILA;
                                            break;
                                case TECLA_LEFT:                                    //TECLA '4'
                                            fifo_indicePrint_dec();
                                            estado = TELA_PRINTFILA;                        
                                            break;

                                case TECLA_DELETE:                                  //TECLA '*'
                                            if(fifo_indice() == 2 )                 //INserido para retornar a pagina anterior
                                                estado = TELA_AJUSTE_INICIAL;
                                            else
                                            {
                                                fifo_delete();
                                                estado = TELA_PRINTFILA;
                                            }
                                            break;    

                                case TECLA_ENTER:   estado = TELA_SALVAR_SEQUENCIA;          break;  

                                case TECLA_T:       estado = TELA_EDITATEMPO;                break;
                                
                                case TELA_SAIDA_ANL: estado = TELA_EDITACONTROLE;            break;
                            }
                            break; 

             case TELA_PRINTFILA:
                            fifo_print();
                            estado = TELA_CONTAR_PASSOS;
                            break;
                    
             case TELA_CONTAR_PASSOS:
                            IHM.printpos(3,0,"<  /  >");                         
                            IHM.printv(3, 1,( fifo_indice()-2 ), 2);           //EXIBE A MENSAGEM "0" NA  2ª LINHA DO DISPLAY - fifo_indice = 2, logo 2-2 = 0
                            IHM.printv(3, 4,( fifo_tam()-2 ), 2);              //EXIBE A MENSAGEM "18" NA 2ª LINHA DO DISPLAY - fifo_tam = 18, logo 18-2 = 16
                            estado = TELA_EDITAR_PASSOS;                       
                            break;
                    
             case TELA_EXECUTANDO_PASSOS:
                            //dispLCD_clr();                            
                            estado = ME_ESPERA_EXECUCAO;
                            meAtuadores = ME_ATUADORES_START;                  //MOMENTO DE INICIO DA EXECUÇÃO
                            break;
                 
             case ME_ESPERA_EXECUCAO:
                            if( meAtuadores == 3 && botao != PAUSE )
                            {                                
                                IHM.printpos(0, 0, "       [    ]       ");
                                printExec(1, -1);
                                printExec(9, 0);
                                printExec(14, 1);  
                                IHM.printpos(2, 0, "<  /  > c:          ");
                                IHM.printv(2, 4,( fifo_indice() - 2 ), 2);
                                IHM.printv(2, 1, ( getIndicePassos() - 1 ), 2);                                         
                                IHM.printv(2, 11, ( getContCiclos() + 1 ), 5);                  //getContCiclos retorna o valor de cont_ciclos = 0;                         
                                
