guilemes1/seqProg_PIC16F887/seqProg_16F887_V1.X/main.c
                            }
                            if(meAtuadores == 0)
                            {
                                estado = TELA_PRINTFILA;
                                IHM.clr();
                            }
                            tecla = teclado_borda();
                            switch(tecla)
                            {
                                case TECLA_PLAY:
                                    botao = PLAY;
                                    break;
                                
                                case TECLA_PAUSE:
                                    botao = PAUSE;
                                    break;
                                    
                                case TECLA_STOP:
                                    botao = STOP;
                                    break;
                                   
                                case TECLA_STEP:
                                    if(botao == PAUSE)
                                        botao = STEP;
                                    break;
                            }
                            break;
                 
             case CONFIG_TEMPO:
                            tecla = teclado_borda();             //VARIAVEL RECEBE O VALOR PRESSIONADO PELO USUARIO
                            if(tecla >= '0' && tecla <= '9')     
                            {
                                dignum_conc(tecla, &num);
                                if(num > 120)
                                    num = 120;
                                estado = TELA_EDITATEMPO;                                
                            }
                            if(tecla == TECLA_DELETE)
                            {
                                dignum_apagar(&num);
                                estado = TELA_EDITATEMPO;
                            }
                            if(tecla == TECLA_ENTER)
                                estado = INSERIR_TEMPOFILA;
                            break;
                            
             case TELA_EDITATEMPO:
                            //dispLCD(1, 0, "cfg tempo:     s");
                            IHM.printpos(2, 0, "config tempo:      s");
                            IHM.printv(2, 15, num, 3);
                            estado = CONFIG_TEMPO;
                            break;
                            
             case INSERIR_TEMPOFILA:
                            fifo_add_tempo(num);
                            IHM.clr();
                            estado = TELA_PRINTFILA;
                            break;
                            
//             case TELA_TITULO_REPETICAO:
//                            IHM.clr();
//                            dispLCD(0, 0, "    Tela de     ");
//                            dispLCD(1, 0, "   Repeticao    ");
//                            setT1(2000);
//                            estado = TELA_DIGNUM_REPETICAO;
//                            break;
                 
//             case TELA_DIGNUM_REPETICAO:
//                            if(!statusT1())
//                            {
//                                IHM.clr();
//                                dispLCD(0, 0, "Digite o numero ");
//                                dispLCD(1, 0, " de repeticoes  ");
//                                setT1(2000);
//                                estado = TELA_CONFIG_REPETICAO;
//                            }
//                            break;
                
//             case TELA_DIGNUM_DELAY:
//                            if(!statusT1())
//                            {
//                               dispLCD_clr(); 
//                               estado = TELA_EDITA_REPETICAO;                    
//                            }
//                            break;
                 
                
             case TELA_CONFIG_REPETICAO:
                            tecla = teclado_borda();
                            if(tecla >= '0' && tecla <= '9')
                               {
                                dignum_conc(tecla, &ciclos);
                                if(ciclos > 10000)
                                    ciclos = 10000;
                                estado = TELA_EDITA_REPETICAO;
                                break;
                               }
                            switch(tecla)
                               {
                                   case 'A':
                                   case 'B':
                                   case 'C':
                                   case 'D':
                                       dispLCD_clr();
                                       estado = TELA_PRINTFILA;
                                       break;
                                   case '#':
                                       estado = ME_INSERIR_CICLO_FILA;
                                       break;
                                   case '*':
                                       dignum_apagar(&ciclos);
                                       estado = TELA_EDITA_REPETICAO;
                                       break;
                               }                    
                            break;                
                 
             case TELA_EDITA_REPETICAO: 
                            IHM.clr();
                            IHM.printpos(0, 0, "Ciclos:             ");
                            IHM.printv(0, 15, ciclos, 5);
                            IHM.printpos(2, 0, "0 - Ciclo continuo  ");
                            estado = TELA_CONFIG_REPETICAO;
                            break;
                            
             case TELA_SALVAR_SEQUENCIA:
                            IHM.print("    DESEJA SALVAR\n"
                                      "     SEQUENCIA ?\n\n"
                                      "# - SIM      * - NAO");
                            
                            tecla = teclado_borda();
                            switch(tecla)
                            {
                                case '#':                  estado = SALVAR_SEQUENCIA_MEMORIA;        break;
                                case '*':   dispLCD_clr(); estado = TELA_EDITA_REPETICAO;            break;                        
                            }
                            break;
                            
             case SALVAR_SEQUENCIA_MEMORIA: 
                            IHM.clr();
                            IHM.print(" ESCOLHA A MEMORIA\n"
                                      " QUE DESEJA SALVAR\n"
                                      " 0   1   2   3   4\n"         //NESSA ETAPA SERIA DESEJAVEL QUE APARECESSE APENAS OS ESPAÃ‡OS DISPONIVEIS
                                      " 5   6   7   8   9  ");  
                            estado = ESPERA_TECLA_SALVAR_SEQUENCIA;
                            
