guilemes1/seqProg_PIC16F887/seqProg_16F887_V1.X/main.c
             case ESPERA_TECLA_SALVAR_SEQUENCIA:
                            tecla = teclado_borda();
                            switch(tecla)
                            {
                                case '0': 
                                case '1': 
                                case '2': 
                                case '3':
                                case '4': 
                                case '5': 
                                case '6': 
                                case '7':
                                case '8': 
                                case '9':
                                           salvar_dado(10, tecla % 0x30, init_cond);      //inclui as condicoes iniciais do atuadores expressa pela variavel "init_cond" na memoria 
                                           EEPROM.salvar(tecla % 0x30, fifo_adrs() + 2);  //inclui a sequencia na posicao "x" escolhida da memoria
                                           estado = TELA_SALVANDO_SEQUENCIA;
                                           break;
                                           
                                case TECLA_DELETE:  IHM.clr();   estado = TELA_SALVAR_SEQUENCIA;       break;   //Inserido para retonar a tela anterior           
                            }
                            break;
                            
             case TELA_SALVANDO_SEQUENCIA:                                            // TELA DE PROCESSAMENTO INICIAL (CARREGA BARRINHAS)
                            IHM.clr();
                            for(char i = 0; i <= 3; i++)
                            {
                                for(char j = 0; j <= 19; j++)
                                {
                                    IHM.printpos(i, j, "\377");
                                    delay(10);
                                }
                            }

                            for(char i = 0; i <= 3; i++)
                            {
                                for(char j = 0; j <= 19; j++)
                                {
                                    IHM.printpos(i, j, " ");
                                    delay(10);
                                }
                            }
                            IHM.printpos(1, 0, "      SEQUENCIA     ");          //EXIBE A MENSAGEM NA 1Âª LINHA DO DISPLAY
                            IHM.printpos(2, 0, "        SALVA       ");
                            
                            setT1(1000);                                   //INICIA A CONTAGEM DO TEMPO DE 1seg
                            estado = TELA_SALVANDO_SEQUENCIA_DELAY;        //MUDA PARA O PROXIMO ESTADO
                            break; 
                            
             case TELA_SALVANDO_SEQUENCIA_DELAY:
                            if(!statusT1())                         //QUANDO TERMINAR A CONTAGEM PASSA PARA O PROXIMO ESTADO
                                estado = TELA_EDITA_REPETICAO;                    
                            break;             
                     
             case TELA_EDITACONTROLE:
                            IHM.printpos(2, 0, "config contrl:     %");
                            IHM.printv(2, 15, num, 3);
                            estado = CONFIG_CONTROLE;
                            break;
                            
             case CONFIG_CONTROLE:
                            tecla = teclado_borda();             //VARIAVEL RECEBE O VALOR PRESSIONADO PELO USUARIO
                            if(tecla >= '0' && tecla <= '9')     //
                            {
                                dignum_conc(tecla, &num);
                                if(num > 100)
                                    num = 100;
                                estado = TELA_EDITACONTROLE;                                
                            }
                            if(tecla == TECLA_DELETE)
                            {
                                dignum_apagar(&num);
                                estado = TELA_EDITACONTROLE;
                            }
                            if(tecla == TECLA_ENTER)
                                estado = INSERIR_CONTROLEFILA;
                            break;
                            
             case INSERIR_CONTROLEFILA:
                            fifo_add_control(num);
                            IHM.clr();
                            estado = TELA_PRINTFILA;
                            break;
                    
             case ME_INSERIR_CICLO_FILA:
                            fifo_add_ciclo(ciclos);
                            estado = TELA_EXECUTANDO_PASSOS;
                            botao = PLAY;
                            break;
        }
 
        serialIOscan();     
 
        switch(meAtuadores)
        {
            case 0:         break;
            
            case 1:
                            resetIndicePassos();   //indice_passos = 2
                            resetContCiclos();     //cont_ciclos = 0               
                            meAtuadores = 2;
                            break;

            case 2:
                            auxPasso = fifo_lerPos(getIndicePassos());        //auxPasso = fila[2] - Passo
                           
                            if(botao == PLAY || botao == STEP || botao == STOP)
                                meAtuadores = 3;
                            break;

            case 3:
                            if(auxPasso & 0x80)   //Se o passo for um tempo
                            {
                                setT1( (unsigned long int)(auxPasso & 0x7F) * 1000 );   //ex: auxPasso = 83(3s), então 0x83 & 0x7F = 0x03, logo 0x03 *1000 = 1000 --> setT1(3000)
                                meAtuadores = 4;
                            }
                            else    //Se o passo for um atuador(caracter)
                            {
                                set_passo(auxPasso, vetorOut);  //
                                meAtuadores = 5;
                            }
                            break;

            case 4:
                            if(!statusT1())
                                meAtuadores = 6;
                            break;

            case 5:
                            if(ler_sensor(auxPasso, vetorIn))
                                meAtuadores = 6;
                            break; 
                    
            case 6:
                            if(botao == STEP)
                            {
                                botao = PAUSE;
                            }
                            meAtuadores = 7;
                            
                            break;
                            
            case 7:
                            addIndicePassos();
                            if(getIndicePassos() < fifo_indice())
                                meAtuadores = 2;
                            else
                            {
                                addContCiclos();
                                meAtuadores = 8;
                            }
                            break;
                    
            case 8:
                            if((botao != STOP) && ((getContCiclos() < getCiclos()) || (getCiclos() == 0)))
                            {
                                resetIndicePassos();
                                meAtuadores = 2;
                            }
                            else
                            {
                                meAtuadores = 0;                        
                            }
                            break;               
        }
    }
    return;
}
